tap "homebrew/bundle"

# Extra taps
tap "ankitpokhrel/jira-cli"
tap "azure/kubelogin"
tap "oven-sh/bun"
tap "pulumi/tap"
tap "sst/tap"

# Development
brew "neovim"
brew "tmux"
brew "tree-sitter"

# Language runtimes
brew "go"
brew "lua"
brew "node"
brew "oven-sh/bun/bun"
brew "ruby"
brew "zig"

# Language servers
brew "ast-grep"
brew "bash-language-server"
brew "biome"
brew "deno"
brew "gopls"
brew "harper"
brew "helm-ls"
brew "lua-language-server"
brew "marksman"
brew "ruff"
brew "rust-analyzer"
brew "shellcheck"
brew "stylua"
brew "superhtml"
brew "typescript-language-server"
brew "vale"
brew "yaml-language-server"
brew "zls"

# Containers
brew "colima"
brew "docker"

# Commandline tools
brew "azure-cli"
brew "azure/kubelogin/kubelogin"
brew "bash"
brew "bat"
brew "difftastic"
brew "direnv"
brew "eza"
brew "fd"
brew "fish"
brew "fx"
brew "fzf"
brew "fzy"
brew "gh"
brew "git"
brew "github-mcp-server"
brew "helm"
brew "hyperfine"
brew "jira-cli"
brew "jq"
brew "k9s"
brew "kube-linter"
brew "kubernetes-cli"
brew "kustomize"
brew "librsvg"
brew "luarocks"
brew "mas"
brew "mcfly"
brew "mise"
brew "ncspot"
brew "netcat"
brew "npm"
brew "pre-commit"
brew "presenterm"
brew "pulumi/tap/pulumi"
brew "ripgrep"
brew "sd"
brew "spotifyd"
brew "sst/tap/opencode"
brew "stern"
brew "tree"
brew "uv"
brew "velero"
brew "watchexec"
brew "websocat"
brew "wget"
brew "yamlfmt"
brew "yamllint"
brew "yq"

# Desktop applications
cask "discord"
cask "element"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "netnewswire"
cask "obsidian"
cask "ollama-app"
cask "raycast"
cask "signal"
cask "spotify"
cask "zoom"

# App Store
mas "Prime Video", id: 545519333
mas "Slack", id: 803453959
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
