tap "homebrew/bundle"

# Extra taps
tap "azure/kubelogin"
tap "oven-sh/bun"
tap "pulumi/tap"

# Development
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "neovim"
brew "tmux"
brew "tree-sitter"
brew "tree-sitter-cli"

# Language runtimes
brew "go"
brew "lua"
brew "node"
brew "odin"
brew "oven-sh/bun/bun"
brew "ruby"
brew "zig"

# Language servers not available through Mason
brew "rover"

# Containers
brew "colima"
brew "docker"

# Commandline tools
brew "azure-cli"
brew "azure/kubelogin/kubelogin"
brew "bash"
brew "bat"
brew "conftest"
brew "coreutils"
brew "difftastic"
brew "direnv"
brew "dnsmasq"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fx"
brew "fzy"
brew "github-mcp-server"
brew "helm"
brew "hyperfine"
brew "jq"
brew "k9s"
brew "kube-linter"
brew "kubernetes-cli"
brew "kustomize"
brew "librsvg"
brew "luarocks"
brew "mas"
brew "mise"
brew "ncspot"
brew "netcat"
brew "pnpm"
brew "opa"
brew "pre-commit"
brew "presenterm"
brew "pulumi/tap/pulumi"
brew "ripgrep"
brew "sd"
brew "spotifyd"
brew "stern"
brew "syft"
brew "tree"
brew "trivy"
brew "uv"
brew "vale"
brew "velero"
brew "watchexec"
brew "websocat"
brew "wget"
brew "yamlfmt"
brew "yamllint"
brew "yq"

# Desktop applications
cask "defold"
cask "discord"
cask "element"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "love"
cask "microsoft-openjdk"
cask "obsidian"
cask "ollama-app"
cask "raycast"
cask "signal"
cask "spotify"
cask "tailscale-app"
cask "zoom"

# App Store
mas "Slack", id: 803453959
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
